Project/Toir.Adaptation/src/InformationRegisters/торо_ПараметрыНаработкиОбъектовРемонта/торо_ПараметрыНаработкиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ababde59-2f1f-44a7-98d4-08f7899e312e">
  <name>торо_ПараметрыНаработкиОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="4cef263b-5fa1-4863-818a-7dfb0891cf97">
    <name>КоэффициентИспользованияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2aa2e5d9-99b7-4aba-8716-37d996878c7e">
    <name>ПлановаяНаработка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2598d42a-db9a-42dd-8af0-040759d58fe4">
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b2680aea-45f2-4122-b381-f641cc7278cd">
    <name>ПериодПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="6ecb2c69-db21-4ac7-8084-4d21792f236c">
    <name>Основной</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="78bf5c81-9b48-4bd0-8822-8511e69534ae">
    <name>гкс_ЗначениеУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="9e6aaa8d-44c6-4d35-804f-6ada915a8d5a">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="da33cd30-a753-4d97-bcb2-e229a3856fa6">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Периодичность</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="473b2fa8-99d9-4792-a6b8-e458d7079650">
    <name>День</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="75346382-d059-4b8c-b2b7-a18ca56176f2">
    <name>Неделя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2360f632-dc4d-4464-8c3c-855804dc7e36">
    <name>Полугодие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a367ecfc-7135-485a-9f99-bc5553ddb898">
    <name>Месяц</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2712affc-b7ac-44a4-8973-8b9e94a64b14">
    <name>Год</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f1050b47-3d75-4dc7-a340-fc03a54222fa">
    <name>Квартал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/CommonModules/торо_РаботаСНаработкой/Module.bsl
#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ОбновитьНаработку")
Функция Расш_гкс_ОбновитьНаработку(ОбъектРемонта, ТиповойОР)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Период,
	|	0 КАК Приоритет,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Основной
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
	|ГДЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРодителей.Приоритет,
	|	ТаблицаРодителей.Родитель
	|ПОМЕСТИТЬ ТаблицаРодителей
	|ИЗ
	|	&ТаблицаРодителей КАК ТаблицаРодителей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	ТаблицаРодителей.Приоритет
	|ПОМЕСТИТЬ ПоказателиГрупп
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
	|			,
	|			ОбъектРемонта В
	|					(ВЫБРАТЬ
	|						ТаблицаРодителей.Родитель
	|					ИЗ
	|						ТаблицаРодителей КАК ТаблицаРодителей)
	|				И НЕ Показатель В
	|						(ВЫБРАТЬ
	|							ПоказателиОР.Показатель
	|						ИЗ
	|							ПоказателиОР КАК ПоказателиОР)) КАК торо_ПараметрыНаработкиОбъектовРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРодителей КАК ТаблицаРодителей
	|		ПО торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = ТаблицаРодителей.Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиГрупп.ОбъектРемонта,
	|	ПоказателиГрупп.Показатель,
	|	ПоказателиГрупп.Период,
	|	ПоказателиГрупп.Приоритет
	|ПОМЕСТИТЬ ПоказателиГруппУникальные
	|ИЗ
	|	ПоказателиГрупп КАК ПоказателиГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоказателиГрупп.Показатель КАК Показатель,
	|			МИНИМУМ(ПоказателиГрупп.Приоритет) КАК Приоритет
	|		ИЗ
	|			ПоказателиГрупп КАК ПоказателиГрупп
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоказателиГрупп.Показатель) КАК ВложенныйЗапрос
	|		ПО ПоказателиГрупп.Показатель = ВложенныйЗапрос.Показатель
	|			И ПоказателиГрупп.Приоритет = ВложенныйЗапрос.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПоказательНаработки КАК ПоказательНаработки,
	|	МАКСИМУМ(торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ЗначениеНаработки) КАК ЗначениеНаработки
	|ПОМЕСТИТЬ ГарантийныеРесурсы
	|ИЗ
	|	РегистрСведений.торо_СрокиГарантииОбъектовРемонта КАК торо_СрокиГарантииОбъектовРемонта
	|ГДЕ
	|	торо_СрокиГарантииОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|	И торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьНаработку
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПоказательНаработки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПоказательНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта,
	|	ПоказателиОР.Показатель,
	|	ПоказателиОР.Период,
	|	ПоказателиОР.Приоритет КАК Приоритет,
	|	ПоказателиОР.ПлановаяНаработка,
	|	ПоказателиОР.ПериодПлановойНаработки,
	|	ПоказателиОР.ПродолжительностьПериодаПлановойНаработки,
	|	ПоказателиОР.КоэффициентИспользованияОборудования,
	|	ЕСТЬNULL(ГарантийныеРесурсы.ЗначениеНаработки, 0) КАК РесурсГарантии,
	|	ПоказателиОР.Основной
	#Вставка
	|	,гкс_ТегиНаработки.Тег КАК гкс_Тег
	#КонецВставки
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантийныеРесурсы КАК ГарантийныеРесурсы
	|		ПО ПоказателиОР.Показатель = ГарантийныеРесурсы.ПоказательНаработки
	#Вставка
	|		Левое Соединение РегистрСведений.гкс_ТегиНаработки КАК гкс_ТегиНаработки
	|		ПО гкс_ТегиНаработки.ОР = ПоказателиОР.ОбъектРемонта И гкс_ТегиНаработки.ПараметрНаработки = ПоказателиОР.Показатель
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиГруппУникальные.ОбъектРемонта,
	|	ПоказателиГруппУникальные.Показатель,
	|	ПоказателиГруппУникальные.Период,
	|	ПоказателиГруппУникальные.Приоритет,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	ЕСТЬNULL(ГарантийныеРесурсы.ЗначениеНаработки, 0),
	|	ЛОЖЬ
	#Вставка
	|	,гкс_ТегиНаработки.Тег КАК гкс_Тег
	#КонецВставки
	|ИЗ
	|	ПоказателиГруппУникальные КАК ПоказателиГруппУникальные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантийныеРесурсы КАК ГарантийныеРесурсы
	|		ПО ПоказателиГруппУникальные.Показатель = ГарантийныеРесурсы.ПоказательНаработки
	#Вставка
	|		Левое Соединение РегистрСведений.гкс_ТегиНаработки КАК гкс_ТегиНаработки
	|		ПО гкс_ТегиНаработки.ОР = ПоказателиГруппУникальные.ОбъектРемонта И гкс_ТегиНаработки.ПараметрНаработки = ПоказателиГруппУникальные.Показатель
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";

	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);

	СписокРодителей = ПолучитьСписокРодителейТиповогоОбъекта(ТиповойОР);
	Если ЗначениеЗаполнено(ТиповойОР) Тогда
		СписокРодителей.Вставить(0, ТиповойОР);
	КонецЕсли;

	ТаблицаРодителей = Новый ТаблицаЗначений;
	ТаблицаРодителей.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	ТаблицаРодителей.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"));
	СчетчикЦикла = СписокРодителей.Количество() - 1;

	Пока СчетчикЦикла >= 0 Цикл
		НоваяСтрокаТабл = ТаблицаРодителей.Добавить();
		НоваяСтрокаТабл.Родитель = СписокРодителей[СчетчикЦикла].Значение;
		НоваяСтрокаТабл.Приоритет = СчетчикЦикла + 1;
		СчетчикЦикла = СчетчикЦикла - 1;
	КонецЦикла;

	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	СтруктураВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл

		#Удаление
		СтруктураВозврата.Добавить(Новый Структура("ОбъектРемонта, Показатель, Период, ПлановаяНаработка, ПериодПлановойНаработки, ПродолжительностьПериодаПлановойНаработки, КоэффициентИспользованияОборудования, РесурсГарантии, Основной",
		Выборка.ОбъектРемонта, Выборка.Показатель, Выборка.Период, Выборка.ПлановаяНаработка, Выборка.ПериодПлановойНаработки, Выборка.ПродолжительностьПериодаПлановойНаработки, Выборка.КоэффициентИспользованияОборудования, Выборка.РесурсГарантии, Выборка.Основной));
		#КонецУдаления
		#Вставка
		ТемпСтрукт = Новый Структура("ОбъектРемонта, Показатель, Период, ПлановаяНаработка, ПериодПлановойНаработки, "
			+"ПродолжительностьПериодаПлановойНаработки, КоэффициентИспользованияОборудования, РесурсГарантии, Основной",
			Выборка.ОбъектРемонта, Выборка.Показатель, Выборка.Период, Выборка.ПлановаяНаработка,
			Выборка.ПериодПлановойНаработки, Выборка.ПродолжительностьПериодаПлановойНаработки,
			Выборка.КоэффициентИспользованияОборудования, Выборка.РесурсГарантии, Выборка.Основной);
		ТемпСтрукт.Вставить("гкс_Тег",Выборка.гкс_Тег);
		СтруктураВозврата.Добавить(ТемпСтрукт);
		#КонецВставки

	КонецЦикла;

	Возврат СтруктураВозврата;

КонецФункции

&ИзменениеИКонтроль("РаспространитьНаработкуНаПодчиненныхДляТекСтроки")
Процедура Расш_гкс_РаспространитьНаработкуНаПодчиненныхДляТекСтроки(ТекСтрокаНаработкаОбъектов, ТабЗначенийНаработкиПодчиненных, ТаблицаПодчиненныхОР, Объект)

	ТаблицаИнтервалов = Новый ТаблицаЗначений;
	ТаблицаИнтервалов.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаИнтервалов.Колонки.Добавить("ПлановыйГрафикРаботы", Новый ОписаниеТипов("СправочникСсылка.Календари"));
	ТаблицаИнтервалов.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаИнтервалов.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	ТаблицаИнтервалов.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.ПараметрыВыработкиОС"));

	НСТаблицаИнтервалов = ТаблицаИнтервалов.Вставить(0);
	НСТаблицаИнтервалов.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
	НСТаблицаИнтервалов.ПлановыйГрафикРаботы = ПолучитьЗначениеПлановогоГрафикаРаботОбъектаРемонта(ТекСтрокаНаработкаОбъектов.Объект);
	НСТаблицаИнтервалов.ДатаНачала = ТекСтрокаНаработкаОбъектов.ДатаРаботыС;
	НСТаблицаИнтервалов.ДатаОкончания = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
	НСТаблицаИнтервалов.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;

	ТабВозврата = торо_РаботаСНаработкой.РасчитатьВремяРаботыОР(ТаблицаИнтервалов.Скопировать(), ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ВремяРаботыГоловногоОбъекта = ТабВозврата.НайтиСтроки(Новый Структура("ОбъектРемонта,ДатаНачала",
	ТекСтрокаНаработкаОбъектов.Объект,ТекСтрокаНаработкаОбъектов.ДатаРаботыС))[0].Секунды;

	ТаблицаИнтервалов.Очистить();			

	Для Каждого ОР ИЗ ТаблицаПодчиненныхОР Цикл
		НСТаблицаИнтервалов = ТаблицаИнтервалов.Добавить();
		НСТаблицаИнтервалов.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
		НСТаблицаИнтервалов.ПлановыйГрафикРаботы = ТекСтрокаНаработкаОбъектов.Объект.ПлановыйГрафикРаботы;
		ДатаВвода = ОР.ОбъектИерархии.ДатаВводаВЭксплуатацию;
		НСТаблицаИнтервалов.ДатаНачала = ?(ДатаВвода > ОР.ДатаНачала,ДатаВвода,ОР.ДатаНачала);
		НСТаблицаИнтервалов.ДатаОкончания = ОР.ДатаОкончания;
		НСТаблицаИнтервалов.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
	КонецЦикла;

	ТабДляРассчетаВремениРаботы = ТаблицаИнтервалов.Скопировать();
	ТабДляРассчетаВремениРаботы.Свернуть("ОбъектРемонта,ПлановыйГрафикРаботы,ДатаНачала,ДатаОкончания,Показатель",);

	ТаблицаСВременемРаботы = торо_РаботаСНаработкой.РасчитатьВремяРаботыОР(ТабДляРассчетаВремениРаботы, ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ТабПодчиненныхССумНаработкой = ТаблицаПодчиненныхОР.Скопировать();
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));   
	ОписаниеТиповЧисло = Новый ОписаниеТипов(МассивТипов);
	ТабПодчиненныхССумНаработкой.Колонки.Добавить("СуммНаработка",ОписаниеТиповЧисло);
	Для Каждого СтрокаСЗависимымОР ИЗ ТабПодчиненныхССумНаработкой Цикл

		ДатаВвода = СтрокаСЗависимымОР.ОбъектИерархии.ДатаВводаВЭксплуатацию;
		пДатаНачала = ?(ДатаВвода > СтрокаСЗависимымОР.ДатаНачала, ДатаВвода, СтрокаСЗависимымОР.ДатаНачала);

		Если ВремяРаботыГоловногоОбъекта = 0 Тогда
			Если ТаблицаСВременемРаботы.НайтиСтроки(Новый Структура("ДатаНачала,ДатаОкончания",пДатаНачала, СтрокаСЗависимымОР.ДатаОкончания))[0].Секунды = 0 Тогда
				КоэфПропорциональностиНаработки = СтрокаСЗависимымОР.Коэффициент;
			Иначе
				#Удаление
				ШаблонСообщения = НСтр("ru = 'Проверьте заполненность графика работы %1 на %2 год.'");
				#КонецУдаления
				#Вставка
				ШаблонСообщения = НСтр("es='Comprueben заполненность del gráfico del trabajo %1 para %2 año.';ru='Проверьте "
				+"заполненность графика работы %1 на %2 год.';en='Check the full schedule for%1 for%2 year.'");
				#КонецВставки
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаНаработкаОбъектов.Объект.ПлановыйГрафикРаботы, Формат(ТекСтрокаНаработкаОбъектов.ДатаРаботыС, "ДФ=гггг"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				ТекСтрокаНаработкаОбъектов.РаспространятьНаПодчиненных = Ложь;
				Возврат;
			КонецЕсли;
		Иначе
			КоэфПропорциональностиНаработки = ТаблицаСВременемРаботы.НайтиСтроки(Новый Структура("ДатаНачала,ДатаОкончания",
			пДатаНачала, СтрокаСЗависимымОР.ДатаОкончания))[0].Секунды / ВремяРаботыГоловногоОбъекта;
		КонецЕсли;
		СтрокаСЗависимымОР.СуммНаработка = ТекСтрокаНаработкаОбъектов.Наработка * КоэфПропорциональностиНаработки * СтрокаСЗависимымОР.Коэффициент;
	КонецЦикла;
	ТабПодчиненныхССумНаработкой.Свернуть("ОбъектИерархии","СуммНаработка");
	СтруктураНаработкиПодчСМаксЗнач = ПолучитьАбсолютныеЗначенияНаработки(ТабЗначенийНаработкиПодчиненных);

	Для Каждого СтрокаСЗависимымОР ИЗ СтруктураНаработкиПодчСМаксЗнач Цикл 

		СтрокаПодчНаработка = Объект.НаработкаПодчиненныхОбъектов.Добавить();
		СтрокаПодчНаработка.ДатаРаботыС 	 = ТекСтрокаНаработкаОбъектов.ДатаРаботыС;
		СтрокаПодчНаработка.ДатаРаботыПо 	 = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
		СтрокаПодчНаработка.Показатель 		 = ТекСтрокаНаработкаОбъектов.Показатель;
		НаработкаОР = ТабПодчиненныхССумНаработкой.НайтиСтроки(Новый Структура("ОбъектИерархии",СтрокаСЗависимымОР.ОбъектРемонта)); 
		Если НЕ НаработкаОР.Количество() = 0 Тогда
			СтрокаПодчНаработка.Наработка 		 = НаработкаОР[0].СуммНаработка;
		КонецЕсли;

		СтрокаПодчНаработка.Объект 				= СтрокаСЗависимымОР.ОбъектРемонта; 
		СтрокаПодчНаработка.РодительИерархии 	= ТекСтрокаНаработкаОбъектов.Объект;

		СтрокаПодчНаработка.СтароеЗначение 						= СтрокаСЗависимымОР.НаработаноЗначение;
		СтрокаПодчНаработка.НаработкаСНачалаЭксплуатацииНачало 	= СтрокаСЗависимымОР.НаработаноЗначение;
		СтрокаПодчНаработка.НаработкаСНачалаЭксплуатации 		= СтрокаПодчНаработка.НаработкаСНачалаЭксплуатацииНачало + СтрокаПодчНаработка.Наработка;

		Если ЗначениеЗаполнено(СтрокаСЗависимымОР.МаксимальноеЗначение)
			И СтрокаСЗависимымОР.НаработаноЗначение + СтрокаПодчНаработка.Наработка > СтрокаСЗависимымОР.МаксимальноеЗначение Тогда

			КоличествоСбросовСчетчика = Цел((СтрокаСЗависимымОР.НаработаноЗначение + СтрокаПодчНаработка.Наработка) / СтрокаСЗависимымОР.МаксимальноеЗначение);
			СтрокаПодчНаработка.НовоеЗначение = СтрокаСЗависимымОР.НаработаноЗначение + СтрокаПодчНаработка.Наработка - КоличествоСбросовСчетчика * СтрокаСЗависимымОР.МаксимальноеЗначение;

		Иначе
			СтрокаПодчНаработка.НовоеЗначение = СтрокаПодчНаработка.СтароеЗначение + СтрокаПодчНаработка.Наработка;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
